{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "APPROVED",
    "1": "DECLINED",
    "2": "OTHER",
    "3": "STIPS_REQUIRED"
  },
  "initializer_range": 0.02,
  "label2id": {
    "APPROVED": 0,
    "DECLINED": 1,
    "OTHER": 2,
    "STIPS_REQUIRED": 3
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.5",
  "vocab_size": 30522
}
